Tekla Open API Reference for Tekla Structures 2025
CustomPartBase Methods
The CustomPartBase type exposes the following members.
Methods
Name | Description
IsDefaultValue(Double)
 Returns true if the given value is set to the default value for this type.
IsDefaultValue(Int32)
 Returns true if the given value is set to the default value for this type.
IsDefaultValue(String)
 Returns true if the given value is set to the default value (empty string).
Run
 The main method of the component. Inside Run the user can implement the logic based on the user given attributes and input. Inside the method input can be found from the provided properties: Primary, Secondaries and Positions.
Top
See Also
Reference
CustomPartBase Class
Tekla.Structures.Plugins Namespace